SushiBits/platform-stm32f1/include/stm32f102xb_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f1xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt)
IRQN_HANDLER(-13, HardFault)
IRQN_HANDLER(-12, MemoryManagement)
IRQN_HANDLER(-11, BusFault)
IRQN_HANDLER(-10, UsageFault)
SKIP_HANDLER(-9)
SKIP_HANDLER(-8)
SKIP_HANDLER(-7)
SKIP_HANDLER(-6)
IRQN_HANDLER(-5, SVCall)
IRQN_HANDLER(-4, DebugMonitor)
SKIP_HANDLER(-3)
IRQN_HANDLER(-2, PendSV)
IRQN_HANDLER(-1, SysTick)
IRQN_HANDLER(0, WWDG)
IRQN_HANDLER(1, PVD)
IRQN_HANDLER(2, TAMPER)
IRQN_HANDLER(3, RTC)
IRQN_HANDLER(4, FLASH)
IRQN_HANDLER(5, RCC)
IRQN_HANDLER(6, EXTI0)
IRQN_HANDLER(7, EXTI1)
IRQN_HANDLER(8, EXTI2)
IRQN_HANDLER(9, EXTI3)
IRQN_HANDLER(10, EXTI4)
IRQN_HANDLER(11, DMA1_Channel1)
IRQN_HANDLER(12, DMA1_Channel2)
IRQN_HANDLER(13, DMA1_Channel3)
IRQN_HANDLER(14, DMA1_Channel4)
IRQN_HANDLER(15, DMA1_Channel5)
IRQN_HANDLER(16, DMA1_Channel6)
IRQN_HANDLER(17, DMA1_Channel7)
IRQN_HANDLER(18, ADC1)
IRQN_HANDLER(19, USB_HP)
IRQN_HANDLER(20, USB_LP)
SKIP_HANDLER(21)
SKIP_HANDLER(22)
IRQN_HANDLER(23, EXTI9_5)
SKIP_HANDLER(24)
SKIP_HANDLER(25)
SKIP_HANDLER(26)
SKIP_HANDLER(27)
IRQN_HANDLER(28, TIM2)
IRQN_HANDLER(29, TIM3)
IRQN_HANDLER(30, TIM4)
IRQN_HANDLER(31, I2C1_EV)
IRQN_HANDLER(32, I2C1_ER)
IRQN_HANDLER(33, I2C2_EV)
IRQN_HANDLER(34, I2C2_ER)
IRQN_HANDLER(35, SPI1)
IRQN_HANDLER(36, SPI2)
IRQN_HANDLER(37, USART1)
IRQN_HANDLER(38, USART2)
IRQN_HANDLER(39, USART3)
IRQN_HANDLER(40, EXTI15_10)
IRQN_HANDLER(41, RTC_Alarm)
IRQN_HANDLER(42, USBWakeUp)

#endif

